app/views/tasks/_new_task_form.html.erb

        <div class="col-md-6">
          <%= f.collection_select :project_id, Project.all, :id, :tittle, class: "form-control" %>
---
SELECT "projects".* FROM "projects"