app/controllers/comments_controller.rb

    def show
      @project = Project.find(params[:project_id])
      @task = Task.find(params[:task_id])
	    @comment = Comment.find(params[:id])
      @docs = Doc.where(comment_id: params[:id])
---
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT ?  [["id", 35], ["LIMIT", 1]]
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 47], ["LIMIT", 1]]
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
SELECT "docs".* FROM "docs" WHERE "docs"."comment_id" = ?  [["comment_id", 31]]

    def edit
  	 @comment = @task.comments.find(params[:id])
---
SELECT  "comments".* FROM "comments" WHERE "comments"."task_id" = ? AND "comments"."id" = ? LIMIT ?  [["task_id", 44], ["id", 20], ["LIMIT", 1]]

	def create
	    @comment = @task.comments.create(comment_params)
---
INSERT INTO "comments" ("text", "task_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["text", "Comentario 1"], ["task_id", 1], ["created_at", "2018-03-21 16:09:36.037215"], ["updated_at", "2018-03-21 16:09:36.037215"]]

    def update
	  @comment = @task.comments.find(params[:id])
      if @comment.update(comment_params)
---
SELECT  "comments".* FROM "comments" WHERE "comments"."task_id" = ? AND "comments"."id" = ? LIMIT ?  [["task_id", 44], ["id", 20], ["LIMIT", 1]]
UPDATE "comments" SET "text" = ?, "updated_at" = ? WHERE "comments"."id" = ?  [["text", "Comentario 2"], ["updated_at", "2018-03-15 05:11:35.624218"], ["id", 20]]

    def destroy
	    @comment = @task.comments.find(params[:id])
	    @comment.destroy
---
SELECT  "comments".* FROM "comments" WHERE "comments"."task_id" = ? AND "comments"."id" = ? LIMIT ?  [["task_id", 43], ["id", 6], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 6]]

    def set_task
      @task = Task.find_by(id: params[:task_id])
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 44], ["LIMIT", 1]]

    def set_params
      @project= Project.find_by(id: params[:project_id])
      @comments = Comment.where(task_id: params[:task_id])
---
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT ?  [["id", 34], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."task_id" = ?  [["task_id", 43]]