app/controllers/docs_controller.rb

	def create
	    @doc = @comment.docs.create(doc_params)
---
INSERT INTO "docs" ("file", "comment_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["file", "todo_app.pdf"], ["comment_id", 31], ["created_at", "2018-03-16 00:27:08.798327"], ["updated_at", "2018-03-16 00:27:08.798327"]]

    def destroy
      @doc = @comment.docs.find(params[:id])
      @doc.destroy
---
SELECT  "docs".* FROM "docs" WHERE "docs"."comment_id" = ? AND "docs"."id" = ? LIMIT ?  [["comment_id", 32], ["id", 5], ["LIMIT", 1]]
DELETE FROM "docs" WHERE "docs"."id" = ?  [["id", 5]]

    def set_params
      @project= Project.find_by(id: params[:project_id])
      @task= Task.find_by(id: params[:task_id])
      @docs = Doc.where(comment_id: params[:comment_id])
---
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT ?  [["id", 35], ["LIMIT", 1]]
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 47], ["LIMIT", 1]]
SELECT "docs".* FROM "docs" WHERE "docs"."comment_id" = ?  [["comment_id", 32]]

    def set_comment
      @comment = Comment.find_by(id: params[:comment_id])
---
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT ?  [["id", 32], ["LIMIT", 1]]