app/controllers/projects_controller.rb

INSERT INTO "projects" ("tittle", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["tittle", "Proyecto 1"], ["created_at", "2018-03-21 14:27:08.089167"], ["updated_at", "2018-03-21 14:27:08.089167"], ["user_id", 14]]
---
    def create
        binding.pry
        @project = Project.new(project_params)
        @project.save

SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "projects" SET "tittle" = ?, "updated_at" = ? WHERE "projects"."id" = ?  [["tittle", "Prueba 100"], ["updated_at", "2018-03-10 00:09:07.622323"], ["id", 4]]
---
    def update
         @project = Project.find(params[:id])
        if @project.update(project_params)

SELECT "projects".* FROM "projects"
---
    def set_projects
        @projects = Project.all

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."project_id" = ? LIMIT ?  [["project_id", nil], ["LIMIT", 1]]
---
    def set_tasks
        @tasks = Task.where(project_id: params[:id])