app/controllers/tasks_controller.rb

SELECT "tasks".* FROM "tasks"
---
    def set_tasks
      @tasks = Task.all