app/controllers/tasks_controller.rb

SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT ?  [["id", 28], ["LIMIT", 1]]
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 29], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."task_id" = ?  [["task_id", 35]]
---
  def show
  	@project = Project.find(params[:project_id])
    @task = Task.find(params[:id])
    @comments = Comment.where(task_id: params[:id])

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."project_id" = ? AND "tasks"."id" = ? LIMIT ?  [["project_id", 7], ["id", 20], ["LIMIT", 1]]
---
  def edit
  	 @task = @project.tasks.find(params[:id])

INSERT INTO "tasks" ("title", "priority", "status", "project_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "Tarea 3"], ["priority", 1], ["status", 1], ["project_id", 1], ["created_at", "2018-03-10 17:26:42.488604"], ["updated_at", "2018-03-10 17:26:42.488604"]]
---
  def create
    @task = @project.tasks.create(task_params)

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."project_id" = ? AND "tasks"."id" = ? LIMIT ?  [["project_id", 7], ["id", 20], ["LIMIT", 1]]
UPDATE "tasks" SET "title" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["title", "Tarea 1"], ["updated_at", "2018-03-11 15:33:53.868710"], ["id", 29]]
---
  def update
    @task = @project.tasks.find(params[:id])
    if @task.update(task_params)

SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."project_id" = ? AND "tasks"."id" = ? LIMIT ?  [["project_id", 1], ["id", 4], ["LIMIT", 1]]
DELETE FROM "tasks" WHERE "tasks"."id" = ?  [["id", 12]]
---
  def destroy
    @project = Project.find(params[:project_id])
    @task = @project.tasks.find(params[:id])
    @task.destroy

SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
---
    def set_project
      @project= Project.find_by(id: params[:project_id])

SELECT "tasks".* FROM "tasks" WHERE "tasks"."project_id" = ?  [["project_id", 4]]
---
    def set_tasks
      @tasks = Task.where(project_id: params[:project_id])